
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	        СтандартнаяОбработка=Ложь;

            ОбработкаРасшифровки=Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки,Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));

            Если ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Поле="Регистратор" Тогда

            Ссылка=ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;

            Ссылка.ПолучитьФорму().Открыть();

            ИначеЕсли ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Поле="ДнейПросрочки" Тогда
				
				ДнейПросрочки =ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;
				
				//Если не ДнейПросрочки = Неопределено и ДнейПросрочки >0 Тогда
					
				Ссылка=ДанныеРасшифровки.Элементы[ДанныеРасшифровки.Элементы[Число(Расшифровка)-1].Идентификатор].ПолучитьПоля()[0].Значение;
                ЗРС = Документы.ЗаявкаНаРасходованиеСредств.СоздатьДокумент();
			    ЗРС.Заполнить(Ссылка);
                ЗРС.ПолучитьФорму().Открыть();
				
				//КонецЕсли;
				
			ИначеЕсли ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Поле="СуммаЗаявокНаРасходование" Тогда
				
				Если ТипЗнч (ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0]) = Тип ("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
					
					ДоговорСсылка=ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
					
				иначе
					
			ДоговорСсылка=ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьРодителей()[0].ПолучитьРодителей()[0].ПолучитьПоля()[0].Значение;
			
		КонецЕсли;
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование КАК ЗаявкаНаРасходование
		|ИЗ
		|	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки КАК ЗаявкиНаРасходованиеСредствОстатки
		|ГДЕ
		|	ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента = &ДоговорСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаявкаНаРасходование УБЫВ";

	Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ОткрытьЗначение(ВыборкаДетальныеЗаписи.ЗаявкаНаРасходование);
		
	КонецЕсли;
	
		
		
			КонецЕсли;

            
КонецПроцедуры
	
