
Процедура КоманднаяПанельФормыОК(Кнопка)
	Закрыть();
КонецПроцедуры

Процедура ПриОткрытии()
	
КонецПроцедуры

Процедура КоманднаяПанельФормыПроверить(Кнопка)
	
	Профиль =  ПолучитьИнтернетПочтовыйПрофиль(); 
	
	ИнтернетПочта = Новый ИнтернетПочта;
	
	Попытка
		ИнтернетПочта.Подключиться(Профиль);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		Проверка = ПроверитьЗаполнениеОбязательныхПолей();
		Если ЗначениеЗаполнено(Проверка) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("" + Проверка);
		КонецЕсли;
		Предупреждение("Произошли ошибки при проверке настроек учетной записи.
					   |Описание ошибки приведено в окне сообщения.");
		Возврат;
	КонецПопытки;
	
	Предупреждение("Проверка подключения к почтовому серверу с заданными параметрами выполнена успешно.");
	

КонецПроцедуры
